Revit 2025 API
ExportEnergyModelType Enumeration
 This enum is used to define if energy model used for gbXML export should be based on rooms/spaces, building elements or analysis mode in EnergyDataSettings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ExportEnergyModelType
Public Enumeration ExportEnergyModelType
public enum class ExportEnergyModelType
type ExportEnergyModelType
Members
Member name | Value | Description
SpatialElement | 0 |  Energy model based on rooms or spaces.
BuildingElement | 1 |  The building element based energy analytical model.
AnalysisMode | 2 |  Energy model based on analysis mode in EnergyDataSettings.
See Also
Reference
Autodesk.Revit.DB Namespace